#!/usr/bin/env php
<?php

/**
 * Example:
 * scp converter.php ismsadmin@192.168.20.170:/tmp/
 * ssh ismsadmin@192.168.20.170
 * cd /tmp/
 * chmod a+x converter.php
 * mysqldump -u rsduadmin -p rsduadmin > rsduadmin.sql
 * ./converter.php rsduadmin.sql
 * mysql -u rsduadmin -p rsduadmin < rsduadmin.sql.converted
 */

if (!isset($argv[1])) die("Enter the file: ./converter.php rsduadmin.sql\n");
if (!file_exists($argv[1])) die("File \"{$argv[1]}\" is not exist\n");

$inputFileName = $argv[1];
$outputFileName = $argv[1] . ".converted";

$map = unserialize('a:65:{i:0;a:2:{i:0;s:3:"№";i:1;s:8:"â„–";}i:1;a:2:{i:0;s:2:"й";i:1;s:4:"Ð¹";}i:2;a:2:{i:0;s:2:"ц";i:1;s:5:"Ñ†";}i:3;a:2:{i:0;s:2:"у";i:1;s:4:"Ñƒ";}i:4;a:2:{i:0;s:2:"к";i:1;s:4:"Ðº";}i:5;a:2:{i:0;s:2:"е";i:1;s:4:"Ðµ";}i:6;a:2:{i:0;s:2:"н";i:1;s:4:"Ð½";}i:7;a:2:{i:0;s:2:"г";i:1;s:4:"Ð³";}i:8;a:2:{i:0;s:2:"ш";i:1;s:4:"Ñˆ";}i:9;a:2:{i:0;s:2:"щ";i:1;s:5:"Ñ‰";}i:10;a:2:{i:0;s:2:"з";i:1;s:4:"Ð·";}i:11;a:2:{i:0;s:2:"х";i:1;s:5:"Ñ…";}i:12;a:2:{i:0;s:2:"ъ";i:1;s:4:"ÑŠ";}i:13;a:2:{i:0;s:2:"ф";i:1;s:5:"Ñ„";}i:14;a:2:{i:0;s:2:"ы";i:1;s:5:"Ñ‹";}i:15;a:2:{i:0;s:2:"в";i:1;s:4:"Ð²";}i:16;a:2:{i:0;s:2:"а";i:1;s:4:"Ð°";}i:17;a:2:{i:0;s:2:"п";i:1;s:4:"Ð¿";}i:18;a:2:{i:0;s:2:"р";i:1;s:5:"Ñ€";}i:19;a:2:{i:0;s:2:"о";i:1;s:4:"Ð¾";}i:20;a:2:{i:0;s:2:"л";i:1;s:4:"Ð»";}i:21;a:2:{i:0;s:2:"д";i:1;s:4:"Ð´";}i:22;a:2:{i:0;s:2:"ж";i:1;s:4:"Ð¶";}i:23;a:2:{i:0;s:2:"э";i:1;s:4:"Ñ";}i:24;a:2:{i:0;s:2:"я";i:1;s:4:"Ñ";}i:25;a:2:{i:0;s:2:"ч";i:1;s:5:"Ñ‡";}i:26;a:2:{i:0;s:2:"с";i:1;s:4:"Ñ";}i:27;a:2:{i:0;s:2:"м";i:1;s:4:"Ð¼";}i:28;a:2:{i:0;s:2:"и";i:1;s:4:"Ð¸";}i:29;a:2:{i:0;s:2:"т";i:1;s:5:"Ñ‚";}i:30;a:2:{i:0;s:2:"ь";i:1;s:4:"ÑŒ";}i:31;a:2:{i:0;s:2:"б";i:1;s:4:"Ð±";}i:32;a:2:{i:0;s:2:"ю";i:1;s:4:"ÑŽ";}i:33;a:2:{i:0;s:2:"Й";i:1;s:5:"Ð™";}i:34;a:2:{i:0;s:2:"Ц";i:1;s:4:"Ð¦";}i:35;a:2:{i:0;s:2:"У";i:1;s:4:"Ð£";}i:36;a:2:{i:0;s:2:"К";i:1;s:4:"Ðš";}i:37;a:2:{i:0;s:2:"Е";i:1;s:5:"Ð•";}i:38;a:2:{i:0;s:2:"Н";i:1;s:4:"Ð";}i:39;a:2:{i:0;s:2:"Г";i:1;s:5:"Ð“";}i:40;a:2:{i:0;s:2:"Ш";i:1;s:4:"Ð¨";}i:41;a:2:{i:0;s:2:"Щ";i:1;s:4:"Ð©";}i:42;a:2:{i:0;s:2:"З";i:1;s:5:"Ð—";}i:43;a:2:{i:0;s:2:"Х";i:1;s:4:"Ð¥";}i:44;a:2:{i:0;s:2:"Ъ";i:1;s:4:"Ðª";}i:45;a:2:{i:0;s:2:"Ф";i:1;s:4:"Ð¤";}i:46;a:2:{i:0;s:2:"Ы";i:1;s:4:"Ð«";}i:47;a:2:{i:0;s:2:"В";i:1;s:5:"Ð’";}i:48;a:2:{i:0;s:2:"А";i:1;s:4:"Ð";}i:49;a:2:{i:0;s:2:"П";i:1;s:4:"ÐŸ";}i:50;a:2:{i:0;s:2:"Р";i:1;s:4:"Ð ";}i:51;a:2:{i:0;s:2:"О";i:1;s:4:"Ðž";}i:52;a:2:{i:0;s:2:"Л";i:1;s:5:"Ð›";}i:53;a:2:{i:0;s:2:"Д";i:1;s:5:"Ð”";}i:54;a:2:{i:0;s:2:"Ж";i:1;s:5:"Ð–";}i:55;a:2:{i:0;s:2:"Э";i:1;s:4:"Ð­";}i:56;a:2:{i:0;s:2:"Я";i:1;s:4:"Ð¯";}i:57;a:2:{i:0;s:2:"Ч";i:1;s:4:"Ð§";}i:58;a:2:{i:0;s:2:"С";i:1;s:4:"Ð¡";}i:59;a:2:{i:0;s:2:"М";i:1;s:4:"Ðœ";}i:60;a:2:{i:0;s:2:"И";i:1;s:4:"Ð˜";}i:61;a:2:{i:0;s:2:"Т";i:1;s:4:"Ð¢";}i:62;a:2:{i:0;s:2:"Ь";i:1;s:4:"Ð¬";}i:63;a:2:{i:0;s:2:"Б";i:1;s:5:"Ð‘";}i:64;a:2:{i:0;s:2:"Ю";i:1;s:4:"Ð®";}}');
$dbDumpContent = file_get_contents($inputFileName);

foreach ($map as $pair) {
    $dbDumpContent = str_replace($pair[1], $pair[0], $dbDumpContent);
}

file_put_contents($outputFileName, $dbDumpContent);
